import streamlit as st

st.title("📌 경추간판 탈출증")

st.subheader("✔️ 정의")
st.write("경추 부위의 추간판이 손상되어 척추 신경을 압박하는 심각한 척추 질환이다.")
st.write("추간판의 섬유성 외층이 파열되고 내부의 수핵 물질이 돌출되어 주변 신경근을 자극하거나 압박함으로써 발생한다.")
         
st.subheader("✔️ 원인")
st.write("외상 및 급격한 목 움직임")
st.write("장기간의 나쁜 자세")
st.write("노화로 인한 디스크 퇴행")
st.write("반복적인 목 부위 스트레스")
st.write("유전적 요인")


st.subheader("✔️ 증상 및 진단")
st.write("심한 목 통증, 어깨와 팔로 방사되는 통증, 저림 및 근육 약화, 신경 압박으로 인한 감각 이상 등의 증상")
st.write("신체 검진, 신경학적 평가, MRI 검사, CT 스캔, 전지진단검사로 진단 가능")


st.subheader("✔️ 운동 루틴")
st.write("목 스트레칭 : 천천히 머리를 좌우로 기울이며 목 근육 이완 - 앞뒤로 부드럽게 목 굽히기 - 목 회전 운동")
st.write("경부 안정화 운동 : 벽에 등을 기대고 머리 위치 교정 - 등 근육 강화를 위한 가벼운 등 들어올리기 - 어깨 안정화 운동")
