import streamlit as st

st.title("📌 요방형근")

st.subheader("✔️ 정의")
st.write("허리 뒤쪽을 지탱하는 근육으로, 허리 통증과 밀접한 연관이 있다.")
st.write("균형 조절 : 직립 시 이완 수축을 통해 몸통이 반대쪽으로 넘어가는 것을 조절한다.")
st.write("골반 안정화 : 골반의 수평을 유지하고 안정화하는 데 기여한다.")
st.write("요추 안정화 : 허리뼈를 안정화하고, 특히 물건을 들거나 몸을 회전할 때 허리를 보호하는 데 중요한 역할을 한다.")


st.subheader("✔️ 문제 발생 시 증상")
st.write("허리 통증 : 특히 허리 옆쪽이나 엉덩이 위쪽으로 통증이 나타나는 경우가 많으며, 기침이나 재채기를 할 때 통증이 심해지기도 한다.")
st.write("자세 불균형 : 골반이 전방 경사나 후방 경사로 변형될 때 요방형근에 가해지는 부하가 증가하여 통증이 유발될 수 있다.")
st.write("다리 길이 차이: 요방형근의 긴장은 골반 비대칭을 유발하여 기능적인 다리 길이 차이를 만들 수도 있다.")


