import streamlit as st

st.title("📌 장요근")

st.subheader("✔️ 정의")
st.write("장골근 + 대요근 = 장요근")
st.write("척추와 골반, 허벅지를 이어주는 복잡한 형태의 근육이다.")

st.write("허리 앞 쪽에 위치하여 요추와 골반의 안정에 중요한 역할을 한다.")

st.write("고관절 굴곡 : 다리를 들어 올리거나 허벅지를 몸통 쪽으로 당기는 주된 역할을 한다.")
st.write("안정화 : 몸의 중심을 잡고, 척추와 골반의 안정화, 요추의 수직 안정화를 도와준다.")


st.subheader("✔️ 문제 발생 시 증상")
st.write("허리 통증 : 장요근이 긴장하면 요추의 과도한 전만을 유발하여 허리 통증의 원인이 될 수 있다.")
st.write("고관절 통증 : 장요근 점액낭염이 발생하면 사타구니 앞 쪽이나 고관절 주변에 통증이 나타날 수 있으며, 보행 시 통증이 심해지기도 한다.")
st.write("자세 불균형 : 장요근의 불균형은 골반의 전방 경사를 유발하여 자세 문제를 일으킬 수 있다.")
st.write("척추와 골반, 허벅지를 이어주는 복잡한 형태의 근육이다.")

st.write("디스크 환자의 경우 거의 대부분이 장요근이 뭉쳐있고 단축되어 있다. -> 디스크에 많은 압력을 가하게 된다.")



