import streamlit as st

st.title("📌 척추 측만증")

st.subheader("✔️ 정의")
st.write("척추가 정상적인 직선 구조에서 벗어나 C자 또는 S자 형태로 비정상적으로 구부러지는 척추 변형 질환")
st.write("척추의 3차원적 변형이 이루어져, 단순한 구조적 문제를 넘어 환자의 전반적인 건강과 삶의 질에 심각한 영향을 끼칠 수 있다.")

st.subheader("✔️ 원인")
st.write("유전적 요인 및 가족력")
st.write("선천적 척추 기형")
st.write("신경근육계 질환 (뇌성마비, 근육병증)")
st.write("특발성 측만증 (명확한 원인을 알 수 없는 경우)")
st.write("외상 및 척추 수술 후 발생 가능한 변형")

st.subheader("✔️ 증상 및 진단")
st.write("비대칭적인 어깨 높이, 한쪽으로 기울어진 허리선, 척추의 비정상적인 만곡 등 근육의 비대칭적인 발달과 호흡곤란 및 폐 기능 저하, 만성 통증 등이 있다.")
st.write("신체 검진, Adams 전방 굴곡 검사, Cobb 각도 측정을 통한 만곡 정도 평가, 척추 전문 X-ray 촬영, MRI 검사, 신경학적 평가를 통해 진단 가능")

st.subheader("✔️ 운동 루틴")
st.write("균형 운동 : 한 발 서기 - 골반 안정화 운동 - 코어 근육 강화")
